import streamlit as st

# فالبداية
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h1 style="text-align: center;"> تخصصك تقني ؟ </h1>
        <h4>المقدمة</h4>
        <p> اليوم بقولك قصة خالد، شاب من المنطقة الشرقية تخصصة علوم حاسب ()، وتحديدًا من الدمام. خالد كان دايم يطمح يحقق شي كبير في حياته المهنية بعد التخرج، وكان مستعد يسوي أي شي عشان يحقق طموحاته.</p>
    </div>
    """,
    unsafe_allow_html=True
)

# بعد ماتخرج وش سوا : بعد ماتخرج اخذ له نظرة على سوق العمل
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h4>رحلة خالد في البحث عن وظيفة</h4>
        <h5>حاول يفهم سوق العمل :نظرة على سوق العمل</h5>
        <p>خالد قرر يبدأ بحثه عن وظيفة بفهم الوضع الوظيفي في المملكة. طالع في البيانات وركز على <strong>توزيع الوظائف حسب المنطقة</strong>. اكتشف أن الرياض تستحوذ على النسبة الأكبر من الفرص الوظيفية بـ 42.3% خصوصا معظم الشركات التقنية موجودة بالرياض ، بينما المنطقة الشرقية، اللي هو منها، تمثل نسبة أقل بـ 14.9%.خالد فكر وقال لنفسه: "الشرقية فيها فرص، بس الرياض فيها فرص أكثر بكثير. إذا كنت أبي أتطور بسرعة، يمكن الرياض تكون خياري الانسب."</p>
    </div>
    """,
    unsafe_allow_html=True
)
st.image("q1.png", caption="توزيع الوظائف حسب المنطقة", use_column_width=True)

#  جا ببالة سؤال : هل جنس الشخص يفرق في الحصول على الوظيفة بشكل عام ؟  
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h5>سؤال ؟: هل الجنس يصعب الحصول على الوظيفة؟</h5>
        <p>بعد كذا، طالع خالد في رسم <strong>تفضيل الشركات </strong>. لقى أن الشركات بشكل عام تطلب الخبرات باستثناء الجنس,بس فية وظايف الجنس مهم فيها ، بعد ما شاف الاحصائية استنتج. وقال لنفسه: "فيه فرص للجنسين ، والنسبة القليلة ماراح تفرق معي ،؟"</p>
    </div>
    """,
    unsafe_allow_html=True
)
st.image("q2.png", caption=" تفضيل الشركات", use_column_width=True)

#بما انة حديث تخرج : هل صحيح كل الشركات تطلب بس خبرات ومايهتمو لحديثين التخرج ؟ 
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h5> اهم سؤال ؟: هل الشركة تبحث عن خبرات فقط ؟ </h5>
        <p>خالد شاف بعدين رسم <strong>الخبرات و الشركات</strong>. لاحظ أن الشركات تطلب حديثين تخرج وبشكل كبير في السوق. وخصوصا بالرياض بحكم العرض والطلب ومثل ما حا عارفين حجم الطلب بالرياض ، معناته أني أقدر ألاقي فرصة أكبر هناك. الرياض مدينة كبيرة والفرص فيها أكثر."</p>
    </div>
    """,
    unsafe_allow_html=True
)
st.image("q4.png", caption="الخبرات و الشركات", use_column_width=True)

# المحطة الرابعة: الراتب المتوقع
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h5>بحكم انه ناوي ينقل: فكر في الراتب المتوقع</h5>
        <p>خالد شاف الرسم اللي يوضح <strong>توقعات الراتب للخريجين الجدد</strong>. عرف أن الرواتب تتراوح بين 4000 و6000 ريال، وقرر يشيك على رواتب الرياض. سمع أن الرياض تقدم رواتب أعلى بسبب حجم المدينة وكثرة الفرص. فكر خالد وقال: "إذا حصلت على وظيفة بالرياض، الراتب أكيد بيكون اسرع و أفضل."</p>
    </div>
    """,
    unsafe_allow_html=True
)
st.image("q3.png", caption="توقعات الراتب للخريجين الجدد", use_column_width=True)

# المحطة الخامسة: التفكير في الانتقال
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h5>هل يسوا ينتقل الى الرياص ؟: التفكير في الانتقال</h5>
        <p>خالد جلس يفكر كل يوم في الانتقال للرياض. فكر في المنافسة العالية لكن برضو فكر في الفرص العظيمة اللي تنتظره هناك. الرياض أكبر، والفرص فيها أكثر، وإذا بيشتغل بجد، أكيد بيحقق طموحاته بشكل أسرع.</p>
    </div>
    """,
    unsafe_allow_html=True
)

# المحطة الأخيرة: اتخاذ القرار
st.markdown(
    """
    <div dir="rtl" style="text-align: right;">
        <h5>قرارة : الانتقال للرياض</h5>
        <p>بعد التفكير والتخطيط، قرر خالد يطلع من منطقة الراحة ويغامر بالانتقال للرياض. جهز نفسه، وبدأ يبحث عن شقق للإيجار بالرياض، وقدم على وظائف هناك. قال لنفسه: "الرياض هي المكان اللي أقدر أبدأ فيه مشواري الكبير. لو ما جربت، ما بعرف وش ممكن أحقق."</p>
        <br><br>
        <h4> قرر الانتقال خلاص : بداية جديدة في الرياض</h4>
        <p>وبكذا، كانت قصة خالد من شاب في الشرقية يحلم بشيء كبير، إلى مغامر قرر يروح للرياض لتحقيق طموحاته وينتهز الفرص. رغم التحديات اللي واجهها، لكنه ما ندم على قراره، لأن الرياض فتحت له فرص وعلاقات ما كان يتوقعها. واليوم، خالد يعتبر قراره بالانتقال للرياض من أفضل القرارات اللي أخذها في حياته المهنية.</p>
        <br><br>
        <h5>خاتمة</h5>
        <p> .الفرص ما تنتظر أحد، لازم تكون جريء وتأخذ خطوات محسوبة لتحقيق أحلامك</p>
    </div>
    """,
    unsafe_allow_html=True
)
